0xsmirk/mcu_cmsis_svd/SiliconLabs/SiM3_NRND/SIM3C1x4.svd
				<register>
					<name>STATUS</name>
					<description>Module Status</description>
					<addressOffset>0x100</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DURF</name>
							<description>Input/Output Data FIFO Underrun Flag. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>No input/output data FIFO underrun.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>An input/output data FIFO underrun has occurred.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DORF</name>
							<description>Input/Output Data FIFO Overrun Flag. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>No input/output data FIFO overrun.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>An input/output data FIFO overrun has occurred.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>XORF</name>
							<description>XOR Data FIFO Overrun Flag. </description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>No XOR data FIFO overrun.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>An XOR data FIFO overrun has occurred.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DFIFOLVL</name>
							<description>Input/Output Data FIFO Level. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>EMPTY</name>
									<description>Input/Output data FIFO is empty.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1WORD</name>
									<description>Input/Output data FIFO contains 1 word.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2WORDS</name>
									<description>Input/Output data FIFO contains 2 words.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>3WORDS</name>
									<description>Input/Output data FIFO contains 3 words.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FULL</name>
									<description>Input/Output data FIFO contains 4 words (full).</description>
									<value>4</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>XFIFOLVL</name>
							<description>XOR Data FIFO Level. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>EMPTY</name>
									<description>XOR data FIFO is empty.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1WORD</name>
									<description>XOR data FIFO contains 1 word.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2WORDS</name>
									<description>XOR data FIFO contains 2 words.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>3WORDS</name>
									<description>XOR data FIFO contains 3 words.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FULL</name>
									<description>XOR data FIFO contains 4 words (full).</description>
									<value>4</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BUSYF</name>
							<description>Module Busy Flag. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>AES module is not busy.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>AES module is completing an operation.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ERRI</name>
							<description>Error Interrupt Flag. </description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>AES error interrupt has not occurred.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>AES error interrupt has occurred.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OCI</name>
							<description>Operation Complete Interrupt Flag. </description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>AES operation complete interrupt has not occurred.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>AES operation complete interrupt occurred.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
