0xsmirk/mcu_cmsis_svd/SiliconLabs/SiM3_NRND/SIM3C1x4.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>DEVICEID_0</name>
			<version>A</version>
			<description>None</description>
			<groupName>DEVICEID_0</groupName>
			<baseAddress>0x400490c0</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xffc</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<!--BASEPOINTER_START_1-->
				<register>
					<name>DEVICEID0</name>
					<description>Device ID Word 0</description>
					<addressOffset>0x0</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>REVID</name>
							<description>Revision ID. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>REVA</name>
									<description>Revision A.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DEVICEID0</name>
							<description>Device ID 0. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>28</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DEVICEID1</name>
					<description>Device ID Word 1</description>
					<addressOffset>0x10</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DEVICEID1</name>
							<description>Device ID 1. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DEVICEID2</name>
					<description>Device ID Word 2</description>
					<addressOffset>0x20</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DEVICEID2</name>
							<description>Device ID 2. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DEVICEID3</name>
					<description>Device ID Word 3</description>
					<addressOffset>0x30</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DEVICEID3</name>
							<description>Device ID 3. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>EPCA_0</name>
			<version>A</version>
			<description>None</description>
			<groupName>EPCA_0</groupName>
			<baseAddress>0x4000e000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xffc</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>EPCA0_IRQn</name>
				<value>24</value>
			</interrupt>
			<registers>
				<!--BASEPOINTER_START_1-->
				<register>
					<name>MODE</name>
					<description>Module Operating Mode</description>
					<addressOffset>0x180</addressOffset>
					<resetValue>0x01FF0000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CLKDIV</name>
							<description>Input Clock Divider. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>10</bitWidth>
						</field>
						<field>
							<name>CLKSEL</name>
							<description>Input Clock (F&lt;subscript&gt;CLKIN&lt;/subscript&gt;) Select. </description>
							<bitOffset>10</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>APB</name>
									<description>Set the APB as the input clock (FCLKIN).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TIMER0</name>
									<description>Set Timer 0 low overflows divided by 2 as the input clock (FCLKIN).</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HL_ECI</name>
									<description>Set high-to-low transitions on ECI divided by 2 as the input clock (FCLKIN).</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXTOSCN</name>
									<description>Set the external oscillator module output (EXTOSCn) divided by 2 as the input clock (FCLKIN).</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ECI</name>
									<description>Set ECI transitions divided by 2 as the input clock (FCLKIN).</description>
									<value>4</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HDOSEL</name>
							<description>High Drive Port Bank Output Select. </description>
							<bitOffset>14</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>THREE_DIFF</name>
									<description>Select three differential outputs from Channels 3, 4, and 5 for the High Drive pins.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TWO_DIFF</name>
									<description>Select the differential outputs from Channels 4 and 5 and non-differential outputs from Channels 2 and 3 for the High Drive pins.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ONE_DIFF</name>
									<description>Select the differential output from Channel 5 and non-differential outputs from Channels 1-4 for the High Drive pins.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NO_DIFF</name>
									<description>Select the non-differential channel outputs (Channels 0-5) for the High Drive pins.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DEND</name>
							<description>DMA Write End Index. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LIMIT</name>
									<description>Set the last register in a DMA write transfer to LIMITUPD.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH0</name>
									<description>Set the last register in a DMA write transfer to Channel 0 CCAPVUPD.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH1</name>
									<description>Set the last register in a DMA write transfer to Channel 1 CCAPVUPD.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH2</name>
									<description>Set the last register in a DMA write transfer to Channel 2 CCAPVUPD.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH3</name>
									<description>Set the last register in a DMA write transfer to Channel 3 CCAPVUPD.</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH4</name>
									<description>Set the last register in a DMA write transfer to Channel 4 CCAPVUPD.</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH5</name>
									<description>Set the last register in a DMA write transfer to Channel 5 CCAPVUPD.</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EMPTY</name>
									<description>Empty slot.</description>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DPTR</name>
							<description>DMA Write Transfer Pointer. </description>
							<bitOffset>19</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LIMIT</name>
									<description>The DMA channel will write to LIMITUPD next.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH0</name>
									<description>The DMA channel will write to Channel 0 CCAPVUPD next.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH1</name>
									<description>The DMA channel will write to Channel 1 CCAPVUPD next.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH2</name>
									<description>The DMA channel will write to Channel 2 CCAPVUPD next.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH3</name>
									<description>The DMA channel will write to Channel 3 CCAPVUPD next.</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH4</name>
									<description>The DMA channel will write to Channel 4 CCAPVUPD next.</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH5</name>
									<description>The DMA channel will write to Channel 5 CCAPVUPD next.</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EMPTY</name>
									<description>Empty slot.</description>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DSTART</name>
							<description>DMA Target Start Index. </description>
							<bitOffset>22</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LIMIT</name>
									<description>Set the first register in a DMA write transfer to LIMITUPD.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH0</name>
									<description>Set the first register in a DMA write transfer to Channel 0 CCAPVUPD.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH1</name>
									<description>Set the first register in a DMA write transfer to Channel 1 CCAPVUPD.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH2</name>
									<description>Set the first register in a DMA write transfer to Channel 2 CCAPVUPD.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH3</name>
									<description>Set the first register in a DMA write transfer to Channel 3 CCAPVUPD.</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH4</name>
									<description>Set the first register in a DMA write transfer to Channel 4 CCAPVUPD.</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH5</name>
									<description>Set the first register in a DMA write transfer to Channel 5 CCAPVUPD.</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EMPTY</name>
									<description>Empty slot.</description>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DBUSYF</name>
							<description>DMA Busy Flag. </description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>IDLE</name>
									<description>The DMA channel is not servicing an EPCA control transfer.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BUSY</name>
									<description>The DMA channel is busy servicing an EPCA control transfer.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>STDOSEL</name>
							<description>Standard Port Bank Output Select. </description>
							<bitOffset>27</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NO_DIFF</name>
									<description>Select the non-differential channel outputs (Channels 0-5) for the standard PB pins.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ONE_DIFF</name>
									<description>Select the differential output from Channel 2 and non-differential outputs from Channels 0, 1, 3, and 4 for the standard PB pins.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TWO_DIFF</name>
									<description>Select the differential outputs from Channels 1 and 2 and non-differential outputs from Channels 0 and 3 for the standard PB pins.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>THREE_DIFF</name>
									<description>Select three differential outputs from Channels 0, 1, and 2 for the standard PB pins.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CONTROL</name>
					<description>Module Control</description>
					<addressOffset>0x190</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>OVFIEN</name>
							<description>EPCA Counter Overflow/Limit Interrupt Enable. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the EPCA counter overflow/limit event interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the EPCA counter overflow/limit event interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OVFDEN</name>
							<description>EPCA Counter Overflow/Limit DMA Request Enable. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Do not request DMA data when a EPCA counter overflow/limit event occurs.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Request DMA data when a EPCA counter overflow/limit event occurs.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OVFSEN</name>
							<description>EPCA Counter Overflow/Limit Synchronization Signal Enable. </description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Do not send a synchronization signal when a EPCA counter overflow/limit event occurs.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Send a synchronization signal when a EPCA counter overflow/limit event occurs.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HALTIEN</name>
							<description>EPCA Halt Input Interrupt Enable. </description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Do not generate an interrupt if the EPCA halt input is high.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Generate an interrupt if the EPCA halt input is high.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>NOUPD</name>
							<description>Internal Register Update Inhibit. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>The EPCA registers will automatically load any new update values after an overflow/limit event occurs.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>The EPCA registers will not load any new update values after an overflow/limit event occurs.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IDLEBEN</name>
							<description>Idle Bypass Enable. </description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>The EPCA module will stop running when the core halts (idle).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>The EPCA module will continue normal operation when the core halts (idle).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DBGMD</name>
							<description>EPCA Debug Mode. </description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>HALT</name>
									<description>A debug breakpoint will stop the EPCA counter/timer.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RUN</name>
									<description>The EPCA will continue to operate while the core is halted in debug mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HALTEN</name>
							<description>Halt Input Enable. </description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>The Halt input (PB_HDKill) does not affect the EPCA counter/timer.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>An assertion of the Halt input (PB_HDKill) will stop the EPCA counter/timer.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>STSEL</name>
							<description>Synchronous Input Trigger Select. </description>
							<bitOffset>11</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>EPCANT0</name>
									<description>Select input trigger 0, EPCAnT0 (Comparator 0 Output).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EPCANT1</name>
									<description>Select input trigger 1, EPCAnT1 (Comparator 1 Output).</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EPCANT2</name>
									<description>Select input trigger 2,  EPCAnT2 (Timer 0 High Overflow ).</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EPCANT3</name>
									<description>Select input trigger 3, EPCAnT3 (Timer 1 High Overflow).</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>STESEL</name>
							<description>Synchronous Input Trigger Edge Select. </description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>FALLING</name>
									<description>A high-to-low transition (falling edge) on EPCAnTx will start the counter/timer.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RISING</name>
									<description>A low-to-high transition (rising edge) on EPCAnTx will start the counter/timer.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>STEN</name>
							<description>Synchronous Input Trigger Enable. </description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the input trigger (EPCAnTx). The EPCA counter/timer will continue to run if the RUN bit is set regardless of the value on the input trigger.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the input trigger (EPCAnTx). If RUN is set to 1, the EPCA counter/timer will start running when the selected input trigger (STSEL) meets the criteria set by STESEL. It will not stop running if the criteria is no longer met.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DIVST</name>
							<description>Clock Divider Output State. </description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>OUTPUT_HIGH</name>
									<description>The clock divider is currently in the first half-cycle.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OUTPUT_LOW</name>
									<description>The clock divider is currently in the second half-cycle.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DIV</name>
							<description>Current Clock Divider Count. </description>
							<bitOffset>22</bitOffset>
							<bitWidth>10</bitWidth>
						</field>
					</fields>
				</register>
