0xsmirk/mcu_cmsis_svd/SiliconLabs/SiM3_NRND/SIM3C1x4.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>UART_1</name>
			<version>A</version>
			<description>None</description>
			<groupName>UART</groupName>
			<baseAddress>0x40003000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xffc</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>UART1_IRQn</name>
				<value>47</value>
			</interrupt>
			<registers>
				<!--BASEPOINTER_START_1-->
				<register>
					<name>CONFIG</name>
					<description>Module Configuration</description>
					<addressOffset>0x0</addressOffset>
					<resetValue>0x030D030D</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RSTRTEN</name>
							<description>Receiver Start Enable. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Do not expect a start bit during receptions.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Expect a start bit during receptions.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RPAREN</name>
							<description>Receiver Parity Enable. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Do not expect a parity bit during receptions.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Expect a parity bit during receptions.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RSTPEN</name>
							<description>Receiver Stop Enable. </description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Do not expect stop bits during receptions.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Expect stop bits during receptions.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RSTPMD</name>
							<description>Receiver Stop Mode. </description>
							<bitOffset>3</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>0P5_STOP</name>
									<description>0.5 stop bit.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1_STOP</name>
									<description>1 stop bit.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1P5_STOP</name>
									<description>1.5 stop bits.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2_STOP</name>
									<description>2 stop bits.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RPARMD</name>
							<description>Receiver Parity Mode. </description>
							<bitOffset>5</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>ODD</name>
									<description>Odd Parity.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EVEN</name>
									<description>Even Parity.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MARK</name>
									<description>Set (Parity = 1).</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SPACE</name>
									<description>Clear (Parity = 0).</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RDATLN</name>
							<description>Receiver Data Length. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>5_BITS</name>
									<description>5 bits.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>6_BITS</name>
									<description>6 bits.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>7_BITS</name>
									<description>7 bits.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8_BITS</name>
									<description>8 bits.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>9_BITS_STORED</name>
									<description>9 bits. The 9th bit is stored in the FIFO (normal mode).</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>9_BITS_MATCH</name>
									<description>9 bits. The 9th bit is not stored in the FIFO (fixed mode). This mode is used when the 9th bit is only used for match operations (see MATMD).</description>
									<value>5</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RSCEN</name>
							<description>Receiver Smartcard Parity Response Enable. </description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>The receiver does not send a Smartcard parity error response.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>The receiver sends a Smartcard Parity response.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RIRDAEN</name>
							<description>Receiver IrDA Enable. </description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>The receiver does not operate in IrDA mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>The receiver operates in IrDA mode. </description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RINVEN</name>
							<description>Receiver Invert Enable. </description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Do not invert the RX pin signals (the RX idle state is high).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Invert the RX pin signals (the RX idle state is low).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TSTRTEN</name>
							<description>Transmitter Start Enable. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Do not generate a start bit during transmissions.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Generate a start bit during transmissions.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TPAREN</name>
							<description>Transmitter Parity Enable. </description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Do not send a parity bit during transmissions.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Send a parity bit during transmissions.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TSTPEN</name>
							<description>Transmitter Stop Enable. </description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Do not send stop bits during transmissions.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Send stop bits during transmissions.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TSTPMD</name>
							<description>Transmitter Stop Mode. </description>
							<bitOffset>19</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>0P5_STOP</name>
									<description>0.5 stop bit.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1_STOP</name>
									<description>1 stop bit.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1P5_STOP</name>
									<description>1.5 stop bits.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2_STOP</name>
									<description>2 stop bits.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TPARMD</name>
							<description>Transmitter Parity Mode. </description>
							<bitOffset>21</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>ODD</name>
									<description>Odd Parity.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EVEN</name>
									<description>Even Parity.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MARK</name>
									<description>Set (Parity = 1).</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SPACE</name>
									<description>Clear (Parity = 0).</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TDATLN</name>
							<description>Transmitter Data Length. </description>
							<bitOffset>24</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>5_BITS</name>
									<description>5 bits.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>6_BITS</name>
									<description>6 bits.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>7_BITS</name>
									<description>7 bits.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8_BITS</name>
									<description>8 bits.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>9_BITS_FIFO</name>
									<description>9 bits. The 9th bit is taken from the FIFO data (normal mode).</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>9_BITS_TBIT</name>
									<description>9 bits. The 9th bit is set by the value of TBIT (fixed mode).</description>
									<value>5</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TSCEN</name>
							<description>Transmitter Smartcard Parity Response Enable. </description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>The transmitter does not check for a Smartcard parity error response.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>The transmitter checks for a Smartcard parity error response.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TIRDAEN</name>
							<description>Transmitter IrDA Enable. </description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable IrDA transmit mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable IrDA transmit mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TINVEN</name>
							<description>Transmitter Invert Enable. </description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Do not invert the TX pin signals (the TX idle state is high).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Invert the TX pin signals (the TX idle state is low).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>MODE</name>
					<description>Module Mode Select</description>
					<addressOffset>0x10</addressOffset>
					<resetValue>0x00600000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DBGMD</name>
							<description>UART Debug Mode. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>RUN</name>
									<description>The UART module will continue to operate while the core is halted in debug mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HALT</name>
									<description>A debug breakpoint will cause the UART module to halt. Any active transmissions and receptions will complete first.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LBMD</name>
							<description>Loop Back Mode. </description>
							<bitOffset>18</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Loop back is disabled and the TX and RX signals are connected to the corresponding external pins.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RX_ONLY</name>
									<description>Receive loop back. The receiver input path is disconnected from the RX pin and internally connected to the transmitter. Data transmitted will be sent out on TX and also received by the device.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TX_ONLY</name>
									<description>Transmit loop back. The transmitter output path is disconnected from the TX pin and the RX input pin is internally looped back out to the TX pin. Data received at RX will be received by the device and also sent directly back out on TX.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BOTH</name>
									<description>Full loop back. Internally, the transmitter output is routed back to the receiver input. Neither the transmitter nor receiver are connected to external device pins. The device pin RX is looped back to TX in a similar fashion. Data transmitted on TX will be sent directly back in on RX.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DUPLEXMD</name>
							<description>Duplex Mode. </description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>FULL_DUPLEX</name>
									<description>Full-duplex mode. The transmitter and receiver can operate simultaneously.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HALF_DUPLEX</name>
									<description>Half-duplex mode. The transmitter automatically inhibits when the receiver is active and the receiver automatically inhibits when the transmitter is active.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ITSEN</name>
							<description>Idle TX Tristate Enable. </description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>The TX and UCLK (if in synchronous master mode) pins are always an output in this mode, even when idle.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>The TX pin is tristated when idle. If ISTCLK is cleared to 0 and the transmitter is configured in synchronous master mode, the UCLK pin will also be tristated when idle.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
